renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/user_application/ota/type2/src/smc_gen/r_memdrv_rx/src/r_memdrv_rx.c
/************************************************************************************************
* Function Name: R_MEMDRV_Rx
* Description  : Receives data for status register and Read ID.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_PARAM                       ;   parameter error
*              : MEMDRV_ERR_HARD                        ;   Hardware error
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t R_MEMDRV_Rx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_RX].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Rx() */

/************************************************************************************************
* Function Name: R_MEMDRV_RxData
* Description  : Receives data using the single mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_PARAM                       ;   parameter error
*              : MEMDRV_ERR_HARD                        ;   Hardware error
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t R_MEMDRV_RxData(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_RX_DATA].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Rx_data() */

/* End Of File */
